tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'mas-cli/tap', pin: true
tap 'netlify/netlifyctl'

brew 'mas' # Mac AppStore CLI

# dependencies
brew 'coreutils'
brew 'automake'
brew 'autoconf'
brew 'openssl'
brew 'libyaml'
brew 'readline'
brew 'libxslt'
brew 'libtool'
brew 'unixodbc'
brew 'freetype'
brew 'bison'
brew 'bison27'
brew 'gettext'
brew 'icu4c'
brew 'jpeg'
brew 'libiconv'
brew 'libpng'
brew 'zlib'

# general
brew 'youtube-dl'
brew 'transmission'
brew 'ffmpeg'
brew 'httpie'
brew 'composer'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'alfred'
cask 'slack'
cask 'beardedspice'
cask 'vlc'
cask 'airserver'
cask 'daisydisk'
cask 'evernote'
cask 'skype'
# cask 'bartender' - Install with SetApp
# cask 'gemini'  - Install with SetApp
mas 'Tweetbot 3 for Twitter', id: 1384080005
mas "Copy'em Paste (Clipboard Mgr.)", id: 876540291
cask 'teamviewer'
cask 'droplr'
cask 'jdownloader'
cask 'airdroid'

# command line / dev tools 
cask 'sublime-text'
cask 'visual-studio-code'
cask 'webstorm'
cask 'rubymine'
cask 'tower2'
brew 'httpie'
cask 'docker'
cask 'kitematic'
# cask 'kaleidoscope'
# cask 'ksdiff'
cask 'sequel-pro'
cask 'psequel'
brew 'wget'
brew 'watch'
#cask 'cd-to'
cask 'colorpicker-skalacolor'
brew 'autojump'
brew 'imagemagick'
cask 'dash'
cask 'zoomus'
cask 'discord'
cask 'ngrok'
brew 'wp-cli'
brew 'dnsmasq'
cask 'postman'
brew 'asdf'
brew 'yarn --without-node'

# iOS dev
cask 'sketch'
#mas 'Marked 2', id: 890031187

# Quick Look Plugins
# checkout https://github.com/sindresorhus/quick-look-plugins
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlcolorcode'
cask 'qlstephen'

brew 'gnupg'
brew "python"
brew "python3"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tmux"
brew "wakatime-cli"
brew "z"
brew "zsh"
cask "1password6"
cask "dropbox"
cask "firefox"
cask "iterm2"
cask "setapp"
cask "slack"
cask "smcfancontrol"
cask "spectacle"
cask "spotify"
cask "switchresx"
cask "telegram"
brew 'postgres'
brew 'redis'
brew 'mysql' 
brew 'netlifyctl'
brew 'php@7.2'
cask 'cyberduck'

# Fonts

cask "font-inconsolata-for-powerline"
cask "font-fira-mono"
cask "font-hack-nerd-font"
cask "font-meslo-for-powerline"
cask "font-meslo-nerd-font"
cask "font-source-code-pro"

mas "Xcode", id: 497799835
